)ATTR
 _ type(input)  caps(on)  color(turq) hilite(uscore)
 ! type(output) caps(off) color(green)
 " type(text)   color(blue ) skip(on)
 + type(text)   color(green) skip(on)
)BODY expand(\\) width(&athwidth)
"&athhdr
+Cmd =>_zcmd \ \+Scrl_scrl+
+
"Primary cmds: ALL, CANcel, eXcl text, Only text, RESet, SORT, NEW
"Line cmds:    Delete, Edit, Insert, Repeat
+
%Sl Dsname
)MODEL clear(zsel)
_z !data                             +
)INIT
 .zvars = '(zsel)'
)PROC
 &athcsrrw = .csrrow
*REXX (zcmd,athcsrrw)
 if abbrev('CANCEL',translate(zcmd),3) then zcmd='CANCEL'
*ENDREXX
 if (&zcmd NE 'CANCEL' AND &athcsrrw GT 0)
   ver (&data,nb)
   /*  note, the list must include 'X'
   /* ver (&zsel,list,D,E,I,R,X)
)END
